Documents/упУстановкаЛимитовРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упУстановкаЛимитовРасходаГСМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упЛимитыРасходаГСМ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Лимиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лимит</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/упЛимитыРасходаГСМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>упЛимитыРасходаГСМ</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расход</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидГСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/упУстановкаЛимитовРасходаГСМ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

// Процедура обработчик события ПередЗаписью объекта
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Изменил = упСервисныеФункцииКлиентСервер.АвторПоследнегоИзмененияОбъекта(ДополнительныеСвойства);	
	ТекстСообщения	= НСтр("ru = 'В табличной части ""%1"" присутствуют строки с продублированными позициями транспортных средств. %2.'");
	ТекстСообщения = СтрШаблон(ТекстСообщения, "Лимиты", Ссылка);
	Для каждого ТекущийЛимит Из Лимиты Цикл		
		ТекущийИндекс = Лимиты.Индекс(ТекущийЛимит);
		ТекущийОтбор = Новый Структура();
		ТекущийОтбор.Вставить("ТранспортноеСредство", ТекущийЛимит.ТранспортноеСредство);
		ТекущийОтбор.Вставить("ВидГСМ", ТекущийЛимит.ВидГСМ);
		НайденныеСтроки = Лимиты.НайтиСтроки(ТекущийОтбор);
		Если НайденныеСтроки.Количество() > 1 Тогда
			Для каждого текСтрока Из НайденныеСтроки Цикл
				ИндексСтроки = Лимиты.Индекс(текСтрока);
				Если НЕ ТекущийИндекс = ИндексСтроки Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Ссылка,"Объект.Лимиты[" + Формат(ИндексСтроки,"ЧН=0; ЧГ=0") + "].ТранспортноеСредство");
				КонецЕсли;
			КонецЦикла;		
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;	
		
КонецПроцедуры

// Процедура обработчик события ОбработкаПроведения объекта
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	БлокировкаДанных = Новый БлокировкаДанных;
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.упЛимитыРасходаГСМ");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Лимиты;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ТранспортноеСредство", "ТранспортноеСредство");	
	
	упСервисныеФункции.УстановитьУправляемуюБлокировку(БлокировкаДанных, Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ДвиженияЛимитыРасходаГСМ	= Движения.упЛимитыРасходаГСМ;
	ДвиженияЛимитыРасходаГСМ.Записывать = Истина;
	
	Для каждого ТекущийЛимит Из Лимиты Цикл
		ДвижениеЛимита = ДвиженияЛимитыРасходаГСМ.Добавить();
		ДвижениеЛимита.Период = Период;
		ДвижениеЛимита.Регистратор = Ссылка;
		ДвижениеЛимита.Организация = Организация;
		ДвижениеЛимита.Подразделение = Подразделение;
		
		ДвижениеЛимита.ТранспортноеСредство = ТекущийЛимит.ТранспортноеСредство;
		ДвижениеЛимита.ВидГСМ = ТекущийЛимит.ВидГСМ;
		ДвижениеЛимита.Лимит = ТекущийЛимит.Лимит;
		ДвижениеЛимита.Расход = 0;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
